Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གང་ཤེས་རབ་ཀྱི་གཏམ་ཐོས་ནས་ཟག་པ་ཟད་པ་ལ་སེམས་གཞོལ་བར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about wisdom and directs his mind toward the elimination of the defilements will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་མང་དུ་ཐོས་པར་དགའ་བ་སྐྱེ་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who rejoices in great learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་ཆོས་ཐོས་ནས་ལུས་སིམ་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who becomes content in his body when he listens to the Dharma will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་ཆོས་ཐོས་ནས་རངས་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who becomes joyful in his mind when he listens to the Dharma will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་ཐེག་པ་ཆེན་པོ་ཐོས་ནས་མོས་པར་འགྱུར་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who becomes motivated after learning about the Mahāyāna will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་བསྡུ་བའི་དངོས་པོ་ཐོས་ནས་གང་བསྡུ་བར་སེམས་སྐྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who learns about the methods for bringing people together and sets his mind on these methods will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་ཐོས་ནས་ དྲན་པ་ལུས་ལ་ཞུགས་པ་དང་། དྲན་པ་ཚོར་བ་ལ་ཞུགས་པ་དང་། དྲན་པ་སེམས་ལ་ཞུགས་པ་དང་། དྲན་པ་ཆོས་ལ་ཞུགས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་ཡང་དག་པར་སྤོང་བའི་གཏམ་ཐོས་ནས་མི་དགེ་བ་སྐྱེས་ཤིང་བྱུང་བདག་ལ་ཁྲེལ་ཞིང་ངོ་ཚ་བར་འགྱུར་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་དགེ་བའི་ཆོས་སྐྱེས་ཤིང་བྱུང་བ་ལ་མི་གཏོང་བར་བློ་འཇུག་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་གཏམ་ཐོས་ནས་ལུས་ཡང་བ་དང་། སེམས་ཡང་བ་དང་། འདུན་པ་ཡང་བ་སྐྱེ་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་བསམ་གཏན་གྱི་གཏམ་ཐོས་ནས་ངེས་པར་རྟོག་པ་ལ་སེམས་གཏོང་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་ཚད་མེད་པའི་གཏམ་ཐོས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། ཕོངས་པར་གྱུར་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེ་བ་དང་། ཆོས་ལ་དགའ་བ་དང་། མི་དགའ་བ་ལ་བཏང་སྙོམས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་དབང་པོའི་གཏམ་ཐོས་ནས་ དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་ལ་སེམས་འཇུག་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་གཏམ་ཐོས་ནས་ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སེམས་འཇུག་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་ལམ་གྱི་གཏམ་ཐོས་ནས་མྱ་ངན་ལས་འདའ་བར་འགྲོ་བ་ལ་སེམས་འཇུག་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡང་དག་པར་བསླབ་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་ཐོས་ནས་ བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་འཇུག་སྟེ དེ་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། ཤཱ་རིའི་བུ་འདི་ནི་ཐོས་པའི་རྣམ་པ་འཇུག་པ་རྣམ་པ་བཞི་བཅུ་རྩ་གཅིག་ཅེས་བྱ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: Someone who listens to talks about establishing mindfulness and remains mindful of his body, mindful of his feelings, mindful of his mind, and mindful of mental phenomena will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks about genuine renunciation and is ashamed and embarrassed by his unwholesome tendencies will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who maintains an intellect that does not shun wholesome states whenever they arise will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on the foundations of magical abilities and develops agility of body, agility of mind, and agility of inclination will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on meditation and steers his mind toward reflection will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on the immeasurables and has love for all sentient beings, compassion for the wretched, empathetic joy for all phenomena, and equanimity toward misdeeds will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on the faculties and directs his mind toward the faculty of faith, the faculty of vigor, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on the factors of awakening and applies his mind to understanding all phenomena will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who listens to talks on the path and applies his mind to attaining nirvāṇa will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who hears of the Tathāgata’s powers, confidence, great love, great compassion, empathetic joy, equanimity, analytical abilities, and eighteen unique, immeasurable buddha qualities and applies his mind to attaining unsurpassed perfect awakening will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. These, Śāriputra, are what are known as the forty-one aspects of engagement with learning, and this, Śāriputra, is how the bodhisatva practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན། བླངས། བཟུང་། བཀླགས། ཀུན་ཆུབ་པར་བྱས། གཞན་ལ་ཡང་བཤད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ནས་ནན་ཏན་སྙིང་པོ་བྱེད་པ་ཡིན་ནོ། ། ཆོས་རྣམས་ལ་ནན་ཏན་བྱེད་པ་གང་ཞེ་ན། གང་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་གནས་པ་སྟེ། དེ་ནི་ཆོས་ལ་ནན་ཏན་བྱེད་པའོ། །
en: “Moreover, Śāriputra, the bodhisatva who practices the perfection of wisdom conscientiously studies the cycle of teachings contained in The Collected Teachings on the Bodhisatva; he learns it, memorizes it, reads it, absorbs it, clarifies it to others, and teaches it in great detail, and when he has done so his insight progresses substantially. How is it that his insight into phenomena progresses? When he masters what he has been taught, his insight into phenomena progresses.

source: གཞན་ཡང་ཆོས་ལ་ནན་ཏན་བྱེད་པ་ནི་གང་ཆོས་ཐམས་ཅད་མི་ལེན་པའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་རྣམས་ལེན་ན་ཡང་ལོག་པའི་ནན་ཏན་དུ་འགྱུར་ཏེ། གང་ཟག་གང་ཆོས་ལེན་པར་གནས་པ་ནི་ཆོས་དེ་དག་ལས་འབྱུང་བར་འགྱུར་བའི་གནས་དང་སྐབས་མེད་དེ་དེ་ནི་གནས་མེད་པའོ། ། གང་ཟག་མི་ལེན་པར་སྤྱོད་པ་རྣམས་ཀྱང་བསལ་བའི་ཕྱིར་ཆོས་འདི་དག་ལ་ནན་ཏན་དུ་བཞག་པ་ཐེ་ཚོམ་དུ་འགྱུར་ན་ ཆོས་ལེན་པར་སྤྱོད་པ་རྣམས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ་ དེ་བས་ན་ཆོས་ཐམས་ཅད་མི་ལེན་པ་ནི་ནན་ཏན་ནོ། །
en: “Moreover, his insight into phenomena progresses when he does not hold on to any phenomena. Why is this? It is because grasping at phenomena stands in opposition to this progress. It is not possible that a person who grasps at phenomena will be able to leave these phenomena behind. This is what is impossible. Even those who are adept at non-grasping have some doubts with regard to their insight into phenomena, and so those who continue to hold on to phenomena will certainly have such doubts. Therefore, by not grasping at any phenomena, insight progresses.

source: གཞན་ཡང་གང་ཆོས་རྣམས་ལ་མི་སྒྲིབ་པ་དེ་ནི་ནན་ཏན་ཞེས་བྱའོ། ། གང་ཆོས་རྣམས་ལ་རློམ་སེམས་མེད་པ་དང་། གང་ཆོས་རྣམས་མི་ལེན་པ་དང་། མི་རློམ་པ་དང་། མི་སྐྱེ་བ་དང་། མི་འགོག་པ་དེ་ནི་ནན་ཏན་ཞེས་བྱའོ། །
en: “Furthermore, what is meant by progressing insight is that phenomena are unobscured. That there is no conceit with regard to phenomena, no grasping, no vanity, no arising, and no ceasing—this is what is meant by progressing insight.

source: གཞན་ཡང་ཆོས་རྣམས་ལ་བསྟན་པ་མེད་པ་དང་། བསལ་བ་མེད་པ་དེ་ནི་ནན་ཏན་ཞེས་བྱའོ། །
en: “Furthermore, what is meant by progressing insight is that there is no appropriation or removal in relation to phenomena.

source: གཞན་ཡང་གང་དུ་ཅུང་ཟད་ཀྱང་མ་བཤད། ཇི་ལྟར་བཤད་པ་བཞིན་དུ་མི་སྣང་བ་དེ་ལྟ་བུ་ནི་ཆོས་ཐམས་ཅད་མི་སྣང་བ། མི་བླང་བ། མཚན་ཉིད་གཅིག་པའོ། ། མཚན་ཉིད་གང་ཞེ་ན། འདི་ལྟ་སྟེ་མཚན་ཉིད་མེད་པའོ། ། མཚན་ཉིད་ཅེས་བྱ་བ་ནི་མཚན་ཉིད་མེད་པ་སྟེ། དེ་ནི་གཉི་ག་ལས་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་བརྟག་པ་འམ། ཡང་དག་པར་བརྟག་པ་དེ་ཉིད་མཚན་ཉིད་མེད་པར་བཤད་པ་ཡིན་ནོ། ། འདི་ནི་མཚན་ཉིད་དོ། ། འདི་ནི་མཚན་ཉིད་མ་ཡིན་པའོ་ཞེས་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་མཚན་ཉིད་མེད་པ་མི་སྣང་བ། བླང་བ་མེད་པར་རྟོགས་པ་དེ་ནི་ནན་ཏན་ཞེས་བྱའོ། ། ནན་ཏན་ལ་བརྩོན་པར་གྱིས་ཤིག །ཆོས་ཐམས་ཅད་མི་སྒྲིབ་པར་སྣང་བ་ཐོབ་པར་གྱིས་ཤིག
en: “Furthermore, nothing is taught anywhere, there is no teaching to be seen, and therefore all phenomena are unseen and ungraspable. They have a single essential characteristic. What is this essential characteristic? It is that they have no essential characteristics. The essential characteristic can be said to be an essential non-characteristic. Both are the case. How so? When one imputes or imposes an essential characteristic, this is an essential non-characteristic. One may say, ‘This essential characteristic is an essential non-characteristic.’ He wakes up to the fact that all phenomena have this as their essential characteristic, namely that they are without characteristics, unseen, and ungraspable—this is what is meant by progressing insight. You should apply yourself to this insight. You must reach the stage where there is no longer any veil between you and phenomena.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: The Lord then spoke these verses:

source: གང་ཞིག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ། །ཤིན་ཏུ་ངེས་པར་ནན་ཏན་གནས་བྱེད་པ། །མཁས་པ་དེ་ནི་ཆོས་ལ་འཛིན་མི་བྱེད། །མི་འཛིན་པས་ན་ནན་ཏན་དེ་འདྲའོ། །
en: “For one who is committed to The Collected Teachings on the Bodhisatva, Insight continually progresses. He is clear sighted. He does not hold on to phenomena.

source: མིས་ནི་ཆོས་རྙེད་སྟོང་པར་མི་བྱེད་དོ། ། ཆོས་ལའང་དེ་ནི་སྟོང་པར་རློམ་སེམས་མེད། །
en: When one is free from grasping, insight progresses. “He does not appropriate phenomena, he does not create emptiness.

source: སྟོང་པའི་ཆོས་ལ་རློམ་སེམས་གང་ཡང་མེད། ། རློམ་སེམས་མེད་ཕྱིར་ནན་ཏན་དེ་འདྲའོ། །
en: He does not dwell on the emptiness of phenomena, And he does not retain any conceit when it comes to empty phenomena.

source: ཆོས་ལ་ལེན་པ་མེད་ཅིང་འདོར་བ་མེད། །
en: “There is no thing to accomplish, nothing to leave behind.

source: ཆོས་ནི་ཆོས་ལ་ལེན་པར་བྱེད་པ་མེད། །
en: Phenomena have no qualities that one can get hold of.

source: ལེན་པ་མེད་ཕྱིར་འདི་ནི་ཆོས་ཀྱི་མཚན། །
en: The essential characteristic of phenomena is that they cannot be grasped.

source: དེ་འདྲ་བ་ནི་ནན་ཏན་ཞེས་བྱའོ། །
en: This is what progress in insight is like.

source: གང་ཕྱིར་ཆོས་ལ་ནམས་ཀྱང་དེ་མི་ཆགས། ། དེ་ལ་དེ་ཡི་ཡེ་ཤེས་བླངས་མི་འགྱུར། ། ཡེ་ཤེས་མ་བླངས་དེ་ལའང་རློམ་སེམས་མེད། ། དེ་འདྲ་བ་ལ་ནན་ཏན་ཞེས་བྱའོ། །
en: “When one does not cling to any phenomena whatsoever And does not regard oneself as the owner of this understanding, When one does not cling to knowledge but maintains an unconceited approach, That is what progress in insight is like.

source: མཁས་པས་སྦྱངས་པའི་ཡོན་ཏན་གནས་པར་གྱིས། །ཆོས་འདི་དག་ལ་ཤིན་ཏུ་བརྩོན་པར་གྱིས། །ཆོ་ག་སྤྱོད་པ་དག་ལ་གནས་གྱུར་ན། ། དེ་ཚེ་དེ་ཡི་སྒོ་ནི་དག་པར་འགྱུར། །
en: “The learned should possess the qualities of simplicity. You should apply yourself to the Dharma. If you act in this way, as I have recommended, You will enter the door of the Dharma and be purified.

source: སྒོ་དག་ན་ནི་ཆོས་འདི་འདྲ་བ་ཤེས། །དེ་ན་སེམས་ལ་བསམ་པའང་ཤེས་པར་འགྱུར། །
en: “The door of purity leads to an understanding of this Dharma, And one will come to know the inclinations of sentient beings.

source: མཁས་པས་དེ་ཚེ་བསམ་པ་ཤེས་ནས་ནི། །འདི་འདྲ་བ་ཡི་ཆོས་ཀྱང་འཆད་པར་འགྱུར། །
en: The wise know the inclinations of sentient beings And teach the Dharma in a way that is suitable.

source: ཟབ་མོའི་ཆོས་ལ་དོན་དམ་མཁས་གྱུར་ནས། ། རྟག་ཏུ་དོན་ལ་རྣམ་པར་གདོན་མི་ཟ། །
en: “He skillfully discerns the ultimate truth of the profound Dharma And is always able to ascertain its meaning.

source: སྤྱོད་པ་མཐའ་ཡས་ཡོན་ཏན་རྣམས་ཀྱིས་འཕགས། །
en: He excels in the qualities of boundless acts.

source: མཁས་པ་མང་དུ་ཐོས་པ་རྒྱ་མཚོ་འདྲ། །
en: The great learning of the knowledgeable one is like the ocean.

source: དེ་ཡི་དོན་དང་ཚིག་འབྲུ་དག་ལ་ཡང་། །མཐའ་མ་རྟོགས་པར་རུང་བ་མ་ཡིན་ཞིང་། །དོན་ཀྱང་མཐའ་ཡས་ཚིག་འབྲུ་མཐའ་ཡས་ཏེ། ། ནན་ཏན་སྙིང་པོར་བྱེད་པ་མི་འཁྲུགས་འགྱུར། །
en: “The meaning of this, the meaning of these words, Is not something that can ever be fully understood. Their meaning is limitless, these words are limitless, And the essence of insight is unshakable.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This, Śāriputra, is how the bodhisatva practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་ཉན་པ་ནས་གཞན་ལ་རྒྱ་ཆེར་བསྟན་པའི་བར་དུ་བྱས་ནས མ་རིག་པའི་མུན་པ་མུན་ནག་མུན་པ་རབ་རིབ་སྟུག་པོ་བསལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་སྟེ། ཤེས་རབ་ཀྱི་སྣང་བའོ། ། དེ་སྣང་བ་དེ་ཐོབ་པས་དགེ་བ་དང་། མི་དགེ་བའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས་ཏེ། ། དེ་སྲོག་གི་ཕྱིར་ཡང་མི་དགེ་བའི་ཆོས་ལ་མི་གནས་ཏེ། དེ་མི་དགེ་བའི་ཆོས་རྣམས་སྤང་བའི་ཕྱིར་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་རྟོགས་པས་ན་དགེ་བ་ཐུབ་པ་ཞི་བ་ཞེས་བྱའོ། །
en: “Moreover, Śāriputra, when the bodhisatva practices the perfection of wisdom, when he is involved in detailed study, and so forth, and when he teaches the cycle of teachings contained in The Collected Teachings on the Bodhisatva to others at great length, all phenomena will become apparent to him, and the darkness of ignorance, the blinding darkness and the constricting veils, will be removed. Wisdom will reveal itself. With this revelation, he will understand what is wholesome and what is unwholesome. He will not act unwholesomely, even in order to save his own life. Someone who, in order to eliminate unwholesome factors, engages in the kind of studies through which wholesome factors can be understood is known as a good and tranquil sage.”

source: ཇི་ལྟར་མུན་པས་ཁྱབ་བསྒྲིབས་པ། །ཁྱིམ་དུ་ཞུགས་པར་གྱུར་ན་ནི། །ཡོད་པར་གྱུར་པའི་གཟུགས་རྣམས་ཀྱང་། །མིག་གིས་མཐོང་བར་མི་འགྱུར་རོ། །
en: “When one enters a gloomy house Filled with darkness, Any forms that may be there Will not be perceptible to the eye.

source: དེ་བཞིན་དུ་ནི་འདི་ལ་ཡང་། །ལ་ལའི་མི་དག་སྐྱེས་གྱུར་ཀྱང་། །དགེ་བ་དང་ནི་སྡིག་པའི་ཆོས། །མ་ཐོས་པར་ནི་ཤེས་མི་འགྱུར། །
en: “In the same way, any human being Who is born here Cannot know right from wrong If he has not learned it first.

source: ཐོས་ནས་ཆོས་རྣམས་རྣམ་པར་ཤེས། །
en: “With learning, one comes to know the Dharma.

source: ཐོས་ནས་སྡིག་པ་སྟེན་མི་བྱེད། །
en: With learning, one will not follow what is wrong.

source: ཐོས་ནས་གནོད་པ་སྤོང་བར་བྱེད། །
en: With learning, one will abandon evil.

source: ཐོས་ནས་མྱ་ངན་འདས་པ་འཐོབ། །
en: With learning, one will attain nirvāṇa.

source: ཐོས་པར་འདོད་པས་ཐོས་པ་འཕེལ། །
en: “If one is keen to learn, learning will flourish.

source: ཐོས་པས་ཤེས་རབ་འཕེལ་བར་འགྱུར། །
en: With learning, wisdom flourishes.

source: ཤེས་རབ་ཀྱི་ནི་དོན་རྣམས་སྦྱོང་། །
en: With wisdom, the meaning of things becomes clearer,

source: དོན་ཐོབ་ནས་ནི་བདེ་འཐོབ་འགྱུར། །
en: And when one grasps the meaning of things, one reaches happiness.

source: དོན་འཐོབ་དེ་ནི་ཡིད་རྣོ་སྟེ། །
en: “Those whose wits are sharp will grasp the meaning of things

source: ཚེ་འདི་ལ་ནི་མྱ་ངན་འདས། །
en: And will attain nirvāṇa even while in the visible world.

source: ཆོས་ལ་སྦྱོར་ཞིང་གཙང་ལ་མཁས། །
en: He is engaged with the Dharma and skilled in purification,

source: ཤིན་ཏུ་བདེ་བ་འཐོབ་པར་འགྱུར། །
en: And he achieves the ultimate happiness.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི། །ཐོས་ནས་ཆོས་ཉིད་གནས་པར་འགྱུར། །
en: “They listen to the collected teachings of the bodhisatvas And master the nature of reality.

source: འཇིག་རྟེན་ལ་ནི་སྣང་གྱུར་ནས། །
en: Among the appearances of the world,

source: བྱང་ཆུབ་ཀྱི་ནི་སྤྱད་པ་སྤྱོད། །
en: They engage in the practice of awakening.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འཛིན་པའི་གང་ཟག་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་ཤིན་ཏུ་བྱང་བར་བྱེད། རྣམ་པར་དག་པར་བྱེད་དེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འདིའི་དོན་གྱི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ་པར་བྱེད། སེམས་ལ་རབ་ཏུ་འཛིན་པར་བྱེད། ཡང་དག་པར་རབ་ཏུ་འཇོག་པར་བྱེད་དེ། དེ་ཡང་དག་པར་སྤོང་བ་བཞི་ལ་རབ་ཏུ་ཞུགས་པས་ཆོས་ཐམས་ཅད་སྒྲིབ་པ་མེད་པ་འཐོབ་བོ། །
en: “Furthermore, Śāriputra, when the bodhisatva practices the perfection of wisdom, as he is someone who keeps to The Collected Teachings on the Bodhisatva, he thinks of his spiritual friends. This cycle of teachings contained in The Collected Teachings on the Bodhisatva is completely purified, fully cleansed, and the motivation to get to the meaning of The Collected Teachings on the Bodhisatva arises in him. He makes an effort, engages with vigor, focuses his mind, and dedicates himself to this task. He applies himself to the four kinds of perfect exertion and gains unobstructed access to all phenomena.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: The Lord then spoke these verses:

source: ཆོས་སྨྲ་བ་ནི་གང་ཡིན་པ། །དེ་ལ་དགེ་བའི་བཤེས་སུ་སེམས། །
en: “He thinks of those who proclaim the Dharma As his spiritual friends.

source: རྟག་པར་ནན་ཏན་གནས་གྱུར་ནས། ། ཆོས་ལ་ནན་ཏན་བྱས་ཏེ་ཉན། །
en: He praises them and listens to the Dharma, Always seeking to advance his insight.

source: རྟག་པར་འདུན་པ་བྲ་མི་བྱེད། །
en: “His motivation is constant, it does not wane.

source: རྟག་པར་བརྩོན་འགྲུས་ཤིན་ཏུ་འཕགས། །
en: His vigor is constant, and it lifts him up.

source: རྟག་པར་ཤེས་རབ་རྣམ་པར་སྦྱོང་། །
en: He constantly purifies his wisdom,

source: ཡེ་ཤེས་ལ་ནི་རྟག་ཏུ་གནས། །
en: And knowledge is his constant abode.

source: དེ་ནི་བདག་ཉིད་ཆོས་ཤེས་ཏེ། །
en: “He knows the Dharma for himself.

source: དད་པའི་ཕྱིར་ནི་འགྲོ་མི་བྱེད། །
en: He is not motivated by faith.

source: སངས་རྒྱས་ཀྱིས་ནི་གང་བཤད་པ། །མི་གཡོ་བ་ཡི་ཆོས་ཤེས་སོ། །
en: He realizes the unmoving reality That the Buddha explains.

source: མཁས་པ་དེ་དག་ཚིག་རྣམས་འབྱེད་ལ་མཁས། །
en: “When the learned ones skilled in making useful distinctions

source: བསླབས་པས་དོན་ལ་ཁོང་དུ་ཆུད་པར་བྱེད། །
en: Grasp the meaning of the teaching through their training,

source: དེ་དག་དཀར་པོའི་ཕྱོགས་ནི་རྟག་པར་སྤྱོད། །
en: They always cultivate positive habits

source: ནག་པོའི་ཕྱོགས་ནི་རྟག་ཏུ་སྦྱོང་བར་བྱེད། །
en: And always turn away from negative ones.

source: དེ་ཡི་སེམས་ལ་ནམས་ཀྱང་ཉམས་པ་མེད། །
en: “He never becomes disheartened.

source: དེ་ནི་ཆོས་རྣམས་གང་ལའང་ཞུམ་པ་མེད། །
en: No Dharma teaching could ever make him feel discouraged.

source: ལུས་ཡང་དེ་བཞིན་སེམས་དང་བརྩོན་འགྲུས་དང་། །འདུན་པ་ཡང་བའང་མྱུར་དུ་ཐོབ་པར་འགྱུར། །
en: A supple body, a mind of vigor, Versatile ambitions—he quickly achieves these things.

source: ཆོས་ཐོས་ནས་ནི་ཤེས་རབ་འཕེལ་བར་འགྱུར། །
en: “His knowledge flourishes because of his study of the Dharma.

source: ཡེ་ཤེས་རྣམ་པར་རྟོགས་ནས་དྲན་མི་ཉམས། །
en: His knowledge is awakened, and his mindfulness does not falter.

source: དྲན་དང་ཡེ་ཤེས་ལ་ནི་རྟག་གནས་ནས། །
en: With mindfulness and knowledge as his constant aides,

source: དགེ་དང་མི་དགེའི་ཆོས་ནི་རབ་ཏུ་ཤེས། །
en: He knows what is virtuous and what is not virtuous.

source: བླ་ན་མེད་པའི་ཆོས་རྣམས་བསླབས་ནས་ནི། །རྟོགས་དང་དྲན་པ་ཤེས་རབ་སྟོབས་མཆོག་ཐོབ། །ཇི་ལྟར་བདག་ཉིད་ཡུན་རིངས་བསླབས་པ་བཞིན། །དེས་ནི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཤེས། །
en: “His training is bolstered by the unsurpassed Dharma. He possesses the highest insight, mindfulness, wisdom, and powers. He knows the inclinations of sentient beings, As he himself has trained for a very long time.

source: ཆོས་བསླབས་ནས་ནི་ཁྱད་པར་འཐོབ་འགྱུར་ཏེ། ། ཁྱད་པར་ཐོབ་ཅིང་ཡེ་ཤེས་དག་གྱུར་ནས། །
en: “By means of his training in the Dharma, he becomes exceptional, And because of his special attainments his knowledge becomes pure.

source: དེ་ནི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཤེས། ། དེ་ཕྱིར་བསམ་པ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །
en: He understands the inclinations of sentient beings And instructs them in the Dharma accordingly.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This, Śāriputra, is how the bodhisatva, the great being, practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ལྟར་བློ་སྦྱངས་པ་དང་། དེ་ལྟར་ཆོས་སྣང་བའི་སྒོ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་འདི་ལྟར་སློབ་སྟེ འཕགས་པའི་ཡང་དག་པར་ལྟ་བ་འབྱུང་བ་ནི་རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། གཞན་གྱི་སྒྲ་དང་བདག་ཉིད་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའོ། ། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གཞན་གྱིས་སྒྲ་དེ་གང་། བདག་ཉིད་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དེ་གང་ཞེ་ན། དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན་འདི་སྙམ་དུ་སེམས་པར་འགྱུར་ཏེ། རྣལ་འབྱོར་སྤྱོད་པ་གང་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས། ། འཕགས་པའི་ཆོས་འདུལ་བ་མ་ཐོས་པར་ཏིང་ངེ་འཛིན་ཙམ་གྱིས་དགའ་བ་རྙེད་ནས་ ང་རྒྱལ་གྱི་དབང་གིས་ཆེ་བའི་ང་རྒྱལ་དུ་ལྷུང་བ་དེ་དག་ནི་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡོངས་སུ་མི་ཐར། སྡུག་བསྔལ་གྱི་ཕུང་པོ་ལས་ཡོངས་སུ་མི་ཐར་ཏེ། དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་དགོངས་ནས་འདི་སྐད་གསུངས་སོ། ། ཕ་རོལ་ལ་རྗེས་སུ་འཐུན་པ་ཐོས་པ་ནི་རྒ་བ་དང་འཆི་བ་ལས་རྣམ་པར་གྲོལ་བའོ། །
en: “Furthermore, Śāriputra, when the bodhisatva, the great being, practices the perfection of wisdom, he trains in this way by purifying his intellect and by completely cleansing the doors through which he perceives phenomena. There are two causes, two conditions, from which the right view of the noble ones arises. What are these two causes, these two conditions? They are the words of others, and a non-superficial understanding of oneself. He thinks, ‘What are the words of others, and what does it mean to understand oneself in a way that is not superficial?’ If he considers this carefully, he will think, ‘Those bodhisatvas who engage in spiritual training but have not learned this cycle of teachings that is contained in The Collected Teachings on the Bodhisatva, those who have not heard the noble teachings on discipline but are fascinated by the practice of the concentrations, will only end up strengthening their selfish arrogance. They will not become free from birth, aging, sickness, death, pain, despair, suffering, depression, and struggle. They will not become free from the whole mass of suffering.’ With this in mind, the Tathāgata gives this advice: ‘If one listens to others with an open mind, one will be freed from aging and death.’ ”

source: ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ།
en: The Lord said:

source: ཆོས་རྣམས་ཐོས་ནས་རྣམ་པར་ཤེས། །
en: “With learning, one comes to know the Dharma.

source: ཐོས་ནས་སྡིག་པ་མི་བྱེད་དེ། །
en: With learning, one will not follow what is wrong.

source: ཐོས་ནས་གནོད་པ་སྤོང་བར་འགྱུར། །
en: With learning, one will abandon evil.

source: ཐོས་འདོད་ཐོས་པ་འཕེལ་བར་འགྱུར། །
en: “If one is keen to learn, learning will flourish.
